Asher-1/ACloudViewer/core/AICore/src/tasks/sam3d/session.cpp
// ----------------------------------------------------------------------------
// -                        CloudViewer: www.cloudViewer.org                  -
// ----------------------------------------------------------------------------
// Copyright (c) 2018-2024 www.cloudViewer.org
// SPDX-License-Identifier: MIT
// ----------------------------------------------------------------------------

// End-to-end pipeline session: condition embedders -> SS flow sampling ->
// occupancy -> coords -> SLat flow sampling -> Gaussian decode -> PLY.
//
// All stage graphs are the parity-verified ones (dino_graph / pointpatch_graph
// / ss_flow_graph / ss_decoder_graph / slat_flow_graph / gs_decoder_graph).
// The sampling loops live host-side (Euler integration + CFG blending); the
// graphs are built once per stage and re-run with fresh inputs.
//
// Inputs (first milestone): the preprocessed condition tensors dumped by
// scripts/dump_e2e_stages.py (ss_input_*.samt). Sampling uses the
// PyTorch-compatible Philox stream; CPU/Vulkan receive the recorded CUDA
// distribution-block contract. --noise-dir replays the torch reference noise.
#include "asset_io.hpp"
#include "dino_graph.hpp"
#include "dtype_contract.hpp"
#include "e2e_options.hpp"
#include "flexicubes.hpp"
#include "gs_decoder_graph.hpp"
#include "image_preprocess.hpp"
#include "mesh_decoder_runner.hpp"
#include "moge_inference.hpp"
#include "pointpatch_graph.hpp"
#include "pose_decoder.hpp"
#include "pytorch_philox_rng.hpp"
#include "slat_flow_graph.hpp"
#include "sparse_ops.hpp"
#include "ss_decoder_graph.hpp"
#include "ss_flow_graph.hpp"
#if defined(SAM3D_USE_CUDA)
#include "pytorch_cuda_rng.hpp"
#endif
#include <fstream>

#include "backend.hpp"
#include "common.hpp"
#include "common/ggml_backend_registry.hpp"
#include "gguf_loader.hpp"
#include "graph_builder.hpp"
#include "sam3dggml.h"
#if defined(SAM3D_USE_NVDIFFRAST_CUDARASTER)
#include "gaussian_renderer.hpp"
#include "native_pbr_pipeline.hpp"
#endif

#include <algorithm>
#include <array>
#include <chrono>
#include <cmath>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <filesystem>
#include <memory>
#include <numeric>
#include <string>
#include <unordered_map>
#include <unordered_set>
#include <vector>

namespace sam3d {

namespace {

// ---------------------------------------------------------------------------
// small helpers
// ---------------------------------------------------------------------------

// CUDA-family match for the per-stage specializations (F16 autocast, the
// CUDA spconv bridge, shared-backend eligibility). Keys off the *family*,
// not the raw request string: "cuda[:N]" and the resolved registry names
// ("CUDA0") are CUDA, and on the SAM3D_USE_CUDA build "auto" resolves to
// the registered CUDA device exactly like the PytorchCudaNormalRng branch
// below. A "cuda" request that falls back to CPU keeps the generic path
// only when the runtime resolved a non-CUDA backend.
static bool be_is_cuda(const char* be) {
    if (be == nullptr) return false;
    if (strncasecmp(be, "cuda", 4) == 0) return true;
#if defined(SAM3D_USE_CUDA)
    return std::strcmp(be, "auto") == 0;
#else
    return false;
#endif
}

struct RawImg {  // HWC f32, ne = [C, W, H] (dino graph convention)
    std::vector<float> data;
    int64_t w = 0, h = 0, c = 0;
};

// torch (1, C, H, W) SAMT dump (ne = [W, H, C], CHW memory) -> HWC buffer
RawImg chw_to_hwc(const RawTensor& t) {
    const int64_t C = t.ne[2], H = t.ne[1], W = t.ne[0];
    GGML_ASSERT(static_cast<size_t>(C * H * W) ==
                t.data.size() / sizeof(float));
    const float* src = (const float*)t.data.data();
    RawImg out;
    out.c = C;
    out.h = H;
    out.w = W;
    out.data.resize((size_t)C * H * W);
    for (int64_t y = 0; y < H; y++)
        for (int64_t x = 0; x < W; x++)
            for (int64_t c = 0; c < C; c++)
                out.data[(y * W + x) * C + c] = src[c * H * W + y * W + x];
    return out;
}

// torch (1, C, H, W) SAMT dump kept in CHW order (pointpatch graph convention)
std::vector<float> as_chw(const RawTensor& t) {
    return std::vector<float>((const float*)t.data.data(),
                              (const float*)t.data.data() + t.data.size() / 4);
}

struct Stage {
    std::unique_ptr<Backend> owned_backend;
    // Points at owned_backend, or at a caller-owned shared backend when the
    // session reuses one backend across requests. Never null while open.
    Backend* backend = nullptr;
    std::unique_ptr<GGUFModel> model;

    bool open(const std::string& gguf,
              const char* be_name,
              int nthreads,
              const char* profile_label = nullptr,
              Backend* shared_backend = nullptr) {
        if (shared_backend) {
            backend = shared_backend;
        } else {
            owned_backend = Backend::create(be_name, nthreads);
            backend = owned_backend.get();
        }
        if (!backend) return false;
        backend->set_profile_label(profile_label ? profile_label : "unlabeled");
        model = std::make_unique<GGUFModel>();
        return model->load(gguf, backend->weights_buffer_type());
    }
    void close() {
        // Frees the GPU weights regardless of ownership; the shared backend
        // itself stays alive for the next stage/request.
        model.reset();
        owned_backend.reset();
        backend = nullptr;
    }
};

struct EulerStep {
    float t = 0.0f;   // model time in [0, 1]
    float dt = 0.0f;  // integration interval to the next model time
};

// Mirrors FlowMatching._prepare_t and ODESolver.solve_iter in the shipped
// Python pipeline. The model receives t * 1000, while Euler integrates over
// the rescaled [0, 1] interval.
std::vector<EulerStep> make_euler_schedule(int steps, float rescale_t) {
    GGML_ASSERT(steps > 0);
    std::vector<float> times(static_cast<size_t>(steps) + 1);
    for (int i = 0; i <= steps; ++i) {
        const double u = static_cast<double>(i) / steps;
        const double t = rescale_t != 0.0f
                                 ? u / (1.0 + (static_cast<double>(rescale_t) -
                                               1.0) * (1.0 - u))
                                 : u;
        times[static_cast<size_t>(i)] = static_cast<float>(t);
    }
    std::vector<EulerStep> schedule;
    schedule.reserve(static_cast<size_t>(steps));
    for (int i = 0; i < steps; ++i) {
        schedule.push_back({times[static_cast<size_t>(i)],
                            times[static_cast<size_t>(i + 1)] -
                                    times[static_cast<size_t>(i)]});
    }
    return schedule;
}

using SparseCoordinate = std::array<int32_t, 4>;

