Asher-1/ACloudViewer/core/AICore/src/tasks/sam3d/session.cpp
    // SKIP_COND=1: no embedder graphs at all (cond from SAMT)
    // SKIP_COND=2: only the fuser graph (dino/pp tokens from the dbg dumps)
    // Isolated flow stages consume tokens written by the cond process.
    const int skip_cond = (flow_stage_env || ss_stage || slat_stage)
                                  ? 1
                                  : (opt.fuser_only ? 2 : 0);
    CondInputs ci;
    std::vector<float> ss_cond;
    std::vector<float> slat_cond;
    if (skip_cond >= 1) {
        if (!slat_stage) {
            const std::string ss_cond_path =
                    opt.ss_cond_path.empty() ? cond_dir + "/ss_cond_tokens.samt"
                                             : opt.ss_cond_path;
            RawTensor ct;
            if (!load_raw_tensor(ss_cond_path, ct) || ct.type != GGML_TYPE_F32)
                return 1;
            ss_cond.assign(reinterpret_cast<const float*>(ct.data.data()),
                           reinterpret_cast<const float*>(ct.data.data()) +
                                   ct.data.size() / 4);
        }
        if (flow_stage_env || slat_stage) {
            const std::string slat_cond_path =
                    opt.slat_cond_path.empty()
                            ? cond_dir + "/slat_cond_tokens.samt"
                            : opt.slat_cond_path;
            RawTensor st3;
            if (!load_raw_tensor(slat_cond_path, st3) ||
                st3.type != GGML_TYPE_F32)
                return 1;
            slat_cond.assign(reinterpret_cast<const float*>(st3.data.data()),
                             reinterpret_cast<const float*>(st3.data.data()) +
                                     st3.data.size() / 4);
        }
        LOGI("e2e: SKIP_COND - fused cond tokens loaded");
    }
    if (!skip_cond) {
        if (!load_cond_inputs(cond_dir, ci)) return 1;
    }
    if (opt.progress) opt.progress(kStageCondition, 0, 0);
    LOGI("e2e: condition inputs %lldx%lld", (long long)ci.W, (long long)ci.H);

    if (cond_stage) {
        int64_t nd = 0;
        DinoDbg dino_dbg_cfg;
        dino_dbg_cfg.enabled = opt.dino_dbg;
        dino_dbg_cfg.debug_stage = opt.debug_stage;
        dino_dbg_cfg.out_path = opt.dino_dbg_out;
        auto d4 = run_dino_batch(ss,
                                 {{"cemb.emb0", &ci.image},
                                  {"cemb.emb0", &ci.rgb_image},
                                  {"cemb.emb1", &ci.mask3},
                                  {"cemb.emb1", &ci.rgb_image_mask3}},
                                 false, nd, &dino_dbg_cfg,
                                 opt.cond_manual_attention);
        if (d4.empty() || d4[0].empty()) {
            LOGE("e2e-cond: dino failed");
            return 1;
        }
        auto p2 = run_pointpatch_batch(ss, "cemb.emb2",
                                       {{&ci.pointmap, {ci.W, ci.H}},
                                        {&ci.rgb_pointmap, {ci.W, ci.H}}});
        if (p2.empty() || p2[0].empty()) {
            LOGE("e2e-cond: pointpatch failed");
            return 1;
        }
        const int64_t n_pp2 = (int64_t)p2[0].size() / 512;
        std::vector<float> cond_out;
        {
            GraphContext gctx;
            std::vector<FuserSeg> segs = {
                    {1024, nd, 0, 0, std::move(d4[0])},
                    {1024, nd, 0, 1, std::move(d4[1])},
                    {1024, nd, 1, 0, std::move(d4[2])},
                    {1024, nd, 1, 1, std::move(d4[3])},
                    {512, n_pp2, 2, 0, std::move(p2[0])},
                    {512, n_pp2, 2, 1, std::move(p2[1])},
            };
            ggml_tensor* out = build_fuser(gctx, *ss.model, segs, "cemb");
            ggml_cgraph* graph =
                    ggml_new_graph_custom(gctx.ctx(), 16384, false);
            ggml_build_forward_expand(graph, out);
            record_dtype_contract_graph("ss_condition_fuser", graph);
            if (!ss.backend->alloc(graph)) return 1;
            for (auto& sg2 : segs)
                if (!ss.backend->set_input_f32(sg2.tokens, sg2.host.data(),
                                               sg2.host.size()))
                    return 1;
            if (!ss.backend->run(graph)) return 1;
            ss.backend->get_tensor_f32(out, cond_out);
        }
        save_raw_tensor_f32(out_ply + ".ss_cond.samt", {1024, 7528},
                            cond_out.data());
        ss.close();  // free the SS weights before the slat embedder stage

        Stage slat_emb;
        if (!slat_emb.open(models_dir + "/slat_generator-" + slat_dt + ".gguf",
                           be_name, nthreads, "condition_slat_generator",
                           static_cast<Backend*>(opt.shared_backend)))
            return 1;
        auto sd = run_dino_batch(slat_emb,
                                 {{"cemb.emb0", &ci.image},
                                  {"cemb.emb0", &ci.rgb_image},
                                  {"cemb.emb1", &ci.mask3},
                                  {"cemb.emb1", &ci.rgb_image_mask3}},
                                 true, nd, nullptr, opt.cond_manual_attention);
        if (sd.empty() || sd[0].empty()) {
            LOGE("e2e-cond: slat dino failed");
            return 1;
        }
        std::vector<float> slat_out;
        {
            GraphContext gctx;
            std::vector<FuserSeg> segs = {
                    {1024, nd, 0, 0, std::move(sd[0])},
                    {1024, nd, 0, 1, std::move(sd[1])},
                    {1024, nd, 1, 0, std::move(sd[2])},
                    {1024, nd, 1, 1, std::move(sd[3])},
            };
            ggml_tensor* out = build_fuser(gctx, *slat_emb.model, segs, "cemb");
            ggml_cgraph* graph =
                    ggml_new_graph_custom(gctx.ctx(), 16384, false);
            ggml_build_forward_expand(graph, out);
            record_dtype_contract_graph("slat_condition_fuser", graph);
            if (!slat_emb.backend->alloc(graph)) return 1;
            for (auto& sg2 : segs)
                if (!slat_emb.backend->set_input_f32(
                            sg2.tokens, sg2.host.data(), sg2.host.size()))
                    return 1;
            if (!slat_emb.backend->run(graph)) return 1;
            slat_emb.backend->get_tensor_f32(out, slat_out);
        }
        save_raw_tensor_f32(out_ply + ".slat_cond.samt", {1024, 5496},
                            slat_out.data());
        LOGI("e2e-cond: done in %.1fs", elapsed_seconds());
        if (!dtype_contract.complete(dtype_contract_error)) {
            LOGE("e2e-cond: failed to write dtype contract: %s",
                 dtype_contract_error.c_str());
            return 1;
        }
        return 0;
    }

    if (!skip_cond) {
        // 4 DINO forwards: emb0(image), emb0(rgb_image), emb1(mask),
        // emb1(rgb_mask)
        int64_t n_dino = 0;
        DinoDbg dino_dbg_cfg;
        dino_dbg_cfg.enabled = opt.dino_dbg;
        dino_dbg_cfg.debug_stage = opt.debug_stage;
        dino_dbg_cfg.out_path = opt.dino_dbg_out;
        auto d = run_dino_batch(ss,
                                {{"cemb.emb0", &ci.image},
                                 {"cemb.emb0", &ci.rgb_image},
                                 {"cemb.emb1", &ci.mask3},
                                 {"cemb.emb1", &ci.rgb_image_mask3}},
                                false, n_dino, &dino_dbg_cfg,
                                opt.cond_manual_attention);
        if (d.empty() || d[0].empty()) {
            LOGE("e2e: dino forward failed");
            return 1;
        }
        std::vector<float> d_img = std::move(d[0]), d_rgb = std::move(d[1]);
        std::vector<float> d_mask = std::move(d[2]), d_rgbm = std::move(d[3]);
        LOGI("e2e: dino tokens done (n=%lld each)", (long long)n_dino);

        // 2 PointPatch forwards (one graph)
        auto p = run_pointpatch_batch(ss, "cemb.emb2",
                                      {{&ci.pointmap, {ci.W, ci.H}},
                                       {&ci.rgb_pointmap, {ci.W, ci.H}}});
        if (p.empty() || p[0].empty()) {
            LOGE("e2e: pointpatch failed");
            return 1;
        }
        std::vector<float> p_pm = std::move(p[0]), p_rgbpm = std::move(p[1]);
        const int64_t n_pp = (int64_t)p_pm.size() / 512;
        if (!dbg_dir.empty()) {
            save_raw_tensor_f32(dbg_dir + "/e2e_pp_tokens.samt", {512, n_pp},
                                p_pm.data());
            save_raw_tensor_f32(dbg_dir + "/e2e_dino_tokens.samt",
                                {1024, n_dino}, d_img.data());
        }
        LOGI("e2e: pointpatch tokens done (n=%lld each)", (long long)n_pp);

