Asher-1/ACloudViewer/core/AICore/src/tasks/sam3d/session.cpp
    // A full Q8 SLat graph changes the gallocr liveness layout enough for the
    // CUDA get_rows kernel to read an invalid source row. Keep the large sparse
    // trunk and the final norm/projection in independent graph allocations.
    GraphContext final_ctx;
    ggml_tensor* final_in = nullptr;
    ggml_tensor* final_out = nullptr;
    ggml_cgraph* final_graph = nullptr;
    if (split_slat_final) {
        final_in = final_ctx.input_f32("slat_pre_final", {128, tb.nf});
        ggml_tensor* final_weight = slat.model->get("dit.out_layer.weight");
        if (!ggml_is_quantized(final_weight->type) &&
            final_weight->type != GGML_TYPE_F32)
            final_weight =
                    ggml_cast(final_ctx.ctx(), final_weight, GGML_TYPE_F32);
        ggml_tensor* final_bias = slat.model->get("dit.out_layer.bias");
        if (final_bias->type != GGML_TYPE_F32)
            final_bias = ggml_cast(final_ctx.ctx(), final_bias, GGML_TYPE_F32);
        final_out = gb_linear(final_ctx.ctx(), final_weight, final_bias,
                              gb_layer_norm(final_ctx.ctx(), final_in, nullptr,
                                            nullptr, 1e-6f));
        final_graph = ggml_new_graph_custom(final_ctx.ctx(), 64, false);
        ggml_set_output(final_out);
        ggml_build_forward_expand(final_graph, final_out);
        record_dtype_contract_graph("slat_final_projection", final_graph);
        if (!slat_final_backend->alloc(final_graph)) {
            LOGE("e2e: SLat final projection alloc failed");
            return 1;
        }
    }

    {
        const auto slat_schedule =
                make_euler_schedule(kSlatSteps, kSlatRescaleT);
        const std::vector<float> zeros_slat_cond(slat_cond.size(), 0.0f);
        const bool dump_slat_steps = opt.dump_slat_steps;
        // Reusing these input buffers across SLat graphs is not yet safe on
        // Vulkan: the cached path changes the final rendered entity. Keep the
        // verified per-forward upload as the default until ownership across
        // graph submissions is made explicit and regression-tested.
        const bool cache_vulkan_tables =
                strstr(slat.backend->backend_name(), "Vulkan") != nullptr &&
                opt.vulkan_table_cache;
        auto upload_slat_tables = [&]() {
            for (size_t ti = 0; ti < slg.inputs.size(); ti++) {
                ggml_tensor* input = slg.inputs[ti];
                if (!input->buffer || !slg.table_data[ti]) continue;
                const auto& host = slg.table_data[ti];
                const bool ok =
                        input->type == GGML_TYPE_F32
                                ? slat.backend->set_input_f32(
                                          input,
                                          reinterpret_cast<const float*>(
                                                  host->data()),
                                          host->size())
                                : slat.backend->set_input_i32(
                                          input, host->data(), host->size());
                if (!ok) {
                    LOGE("e2e: failed to upload SLat table %s", input->name);
                    return false;
                }
            }
            return true;
        };
        if (cache_vulkan_tables && !upload_slat_tables()) return 1;
        if (dump_slat_steps && !dbg_dir.empty()) {
            save_raw_tensor_f32(dbg_dir + "/slat_ggml_x000.samt", {8, tb.nf},
                                x_slat.data());
        }
        size_t debug_slat_forwards = 0;
        if (opt.debug_slat_forwards < 0) {
            LOGE("e2e: --debug-slat-forwards must be a positive integer");
            return 1;
        }
        if (opt.debug_slat_forwards > 0) {
            debug_slat_forwards = static_cast<size_t>(opt.debug_slat_forwards);
        } else if (opt.debug_once) {
            debug_slat_forwards = 1;
        }
        const char* debug_slat_output = opt.debug_slat_output.c_str();
        size_t completed_debug_slat_forwards = 0;

        // Loop-timing diagnostic was an environment opt-in in the source
        // runtime; AICore forbids task-level environment control, so the
        // diagnostic split is disabled and stage timings flow through the
        // common aicore_pipeline_timings contract instead.
        const bool loop_timing = false;
        double t_upload = 0, t_run = 0, t_read = 0;
        auto now_ms = [] {
            return std::chrono::duration<double, std::milli>(
                           std::chrono::steady_clock::now().time_since_epoch())
                    .count();
        };
        for (size_t s = 0; s < slat_schedule.size(); ++s) {
            const float t_v = slat_schedule[s].t * 1000.0f;
            const double tu0 = loop_timing ? now_ms() : 0;
            if (slg.x->buffer && !slat.backend->set_input_f32(
                                         slg.x, x_slat.data(), x_slat.size()))
                return 1;
            if (slg.cond->buffer &&
                !slat.backend->set_input_f32(slg.cond, slat_cond.data(),
                                             slat_cond.size()))
                return 1;
            if (slg.t->buffer && !slat.backend->set_input_f32(slg.t, &t_v, 1))
                return 1;
            if (!cache_vulkan_tables) {
                if (!upload_slat_tables()) return 1;
                if (opt.verify) {
                    for (ggml_tensor* t : slg.inputs) {
                        if (!t->buffer || t->type != GGML_TYPE_I32) continue;
                        std::vector<int32_t> device;
                        slat.backend->get_tensor_i32(t, device);
                        const auto [lo, hi] = std::minmax_element(
                                device.begin(), device.end());
                        LOGI("verify: %s rows [%d, %d] (%zu values)", t->name,
                             *lo, *hi, device.size());
                    }
                }
            }
            const double tu1 = loop_timing ? now_ms() : 0;
            if (!slat.backend->run(s_graph)) {
                LOGE("e2e: slat step %zu failed", s);
                return 1;
            }
            const double tr0 = loop_timing ? now_ms() : 0;
            std::vector<float> vc;
            slat.backend->get_tensor_f32(s_outs[0], vc);
            const double tr1 = loop_timing ? now_ms() : 0;
            if (loop_timing) {
                t_upload += tu1 - tu0;
                t_run += tr0 - tu1;
                t_read += tr1 - tr0;
            }
            if (split_slat_final) {
                if (!slat_final_backend->set_input_f32(final_in, vc.data(),
                                                       vc.size()) ||
                    !slat_final_backend->run(final_graph) ||
                    !slat_final_backend->get_tensor_f32(final_out, vc)) {
                    LOGE("e2e: SLat final projection failed");
                    return 1;
                }
            }
            if (debug_slat_forwards != 0 &&
                ++completed_debug_slat_forwards >= debug_slat_forwards) {
                if (debug_slat_output && *debug_slat_output) {
                    if (!save_raw_tensor_f32(debug_slat_output, {8, tb.nf},
                                             vc.data())) {
                        LOGE("e2e: failed to write SLat debug output %s",
                             debug_slat_output);
                        return 1;
                    }
                }
                LOGI("e2e: completed %zu SLat debug forward(s)",
                     completed_debug_slat_forwards);
                return 0;
            }
            const bool cfg_active = t_v >= kSlatCfgStart && t_v <= kSlatCfgEnd;
            std::vector<float> vu;
            if (cfg_active) {
                if (!cache_vulkan_tables && !upload_slat_tables()) return 1;
                if (slg.x->buffer &&
                    !slat.backend->set_input_f32(slg.x, x_slat.data(),
                                                 x_slat.size()))
                    return 1;
                if (slg.t->buffer &&
                    !slat.backend->set_input_f32(slg.t, &t_v, 1))
                    return 1;
                if (!slat.backend->set_input_f32(slg.cond,
                                                 zeros_slat_cond.data(),
                                                 zeros_slat_cond.size()))
                    return 1;
                if (!slat.backend->run(s_graph)) {
                    LOGE("e2e: slat uncond step %zu failed", s);
                    return 1;
                }
                slat.backend->get_tensor_f32(s_outs[0], vu);
                if (split_slat_final) {
                    if (!slat_final_backend->set_input_f32(final_in, vu.data(),
                                                           vu.size()) ||
                        !slat_final_backend->run(final_graph) ||
                        !slat_final_backend->get_tensor_f32(final_out, vu)) {
                        LOGE("e2e: SLat final uncond projection failed");
                        return 1;
                    }
                }
            }
            for (size_t k = 0; k < x_slat.size(); k++) {
                const float velocity =
                        cfg_active ? vc[k] + kSlatCfgStrength * (vc[k] - vu[k])
                                   : vc[k];
                x_slat[k] += slat_schedule[s].dt * velocity;
            }
            if (dump_slat_steps && !dbg_dir.empty()) {
                char name[64];
                snprintf(name, sizeof(name), "/slat_ggml_x%03zu.samt", s + 1);
                save_raw_tensor_f32(dbg_dir + name, {8, tb.nf}, x_slat.data());
            }
            if (s % 5 == 4)
                LOGI("e2e: slat step %zu/%zu", s + 1, slat_schedule.size());
        }
        if (loop_timing) {
            LOGI("e2e: slat loop timing: upload=%.2fs graph=%.2fs "
                 "readback=%.2fs over %zu runs",
                 t_upload / 1000.0, t_run / 1000.0, t_read / 1000.0,
                 slat_schedule.size());
        }
    }
    // The deployment trajectory gate consumes the normalized latent written
    // above.  Stop before decoder work so a SLat numerical diagnosis neither
    // changes the observed tensor nor spends time producing a throwaway PLY.
    if (opt.slat_flow_only) {
        LOGI("e2e: SLat flow-only replay complete");
        return 0;
    }
    LOGI("e2e: slat flow done in %.1fs", elapsed_seconds());
    // denormalize: feats * STD + MEAN (per channel)
    for (int64_t n = 0; n < tb.nf; n++)
        for (int c = 0; c < 8; c++)
            x_slat[n * 8 + c] = x_slat[n * 8 + c] * SLAT_STD[c] + SLAT_MEAN[c];
    if (!dbg_dir.empty())
        save_raw_tensor_f32(dbg_dir + "/e2e_slat_feats.samt", {8, tb.nf},
                            x_slat.data());
    slat.close();

    // ---------------- stage C: Gaussian decode + PLY ---------------------
    Stage gs;
    if (opt.progress) opt.progress(kStageGsDecode, 0, 0);
    if (!gs.open(models_dir + "/slat_decoder_gs-" + gs_dt + ".gguf", be_name,
                 nthreads, "gaussian_decoder",
                 static_cast<Backend*>(opt.shared_backend))) {
        LOGE("e2e: failed to load slat_decoder_gs-%s", gs_dt.c_str());
        return 1;
    }
    GsTables gtb;
    if (!gtb.build(coords.data(), n_coord)) {
        LOGE("e2e: gs tables failed");
        return 1;
    }
    // offset perturbation (hammersley) from the GGUF: ggml ne = [3, 32].
    // The converter writes torch's [3, 32] C-order buffer, which is already
    // flattened as [gaussian * 3 + channel] in ggml memory.
    ggml_tensor* pert = gs.model->get("gsdec.offset_perturbation");
    GGML_ASSERT(pert && pert->ne[0] == 3 && pert->ne[1] == GS_NGAUSS);
    std::vector<float> perturb;
    gs.backend->get_tensor_f32(pert, perturb);
    GGML_ASSERT(perturb.size() == static_cast<size_t>(GS_NGAUSS * 3));

    GraphContext gg;
    GsDecoderGraph gdg;
    gdg.g = &gg;
    gdg.m = gs.model.get();
    gdg.tb = &gtb;
#ifdef SAM3D_USE_CUDA
    gdg.use_pytorch_cuda_attention =
            std::strstr(gs.backend->backend_name(), "CUDA") != nullptr &&
            !opt.gs_portable_attention;
#endif
    ggml_tensor* g_x = gg.input_f32("x", {8, tb.nf});
    gdg.x = g_x;
    gdg.inputs.push_back(g_x);
    gdg.table_data.push_back(nullptr);
    auto g_outs = gdg.build();  // [0] = raw feats (448, N)
    ggml_cgraph* g_graph = ggml_new_graph_custom(gg.ctx(), 65536, false);
    for (auto* o : g_outs) {
        ggml_set_output(o);
        ggml_build_forward_expand(g_graph, o);
    }
    record_dtype_contract_graph("gaussian_decoder", g_graph);
    if (!gs.backend->alloc(g_graph)) {
        LOGE("e2e: gs alloc failed");
        return 1;
    }
    if (!gs.backend->set_input_f32(g_x, x_slat.data(), x_slat.size())) return 1;
    for (size_t ti = 0; ti < gdg.inputs.size(); ti++) {
        ggml_tensor* t = gdg.inputs[ti];
        if (!t->buffer || !gdg.table_data[ti]) continue;
        const auto& host = gdg.table_data[ti];
        const bool ok =
                t->type == GGML_TYPE_F32
                        ? gs.backend->set_input_f32(
                                  t,
                                  reinterpret_cast<const float*>(host->data()),
                                  host->size())
                        : gs.backend->set_input_i32(t, host->data(),
                                                    host->size());
        if (!ok) return 1;
    }
    if (!gs.backend->run(g_graph)) {
        LOGE("e2e: gs run failed");
        return 1;
    }
    std::vector<float> raw;
    gs.backend->get_tensor_f32(g_outs[0], raw);
    gs.close();
    LOGI("e2e: gaussian decode done in %.1fs", elapsed_seconds());

