Asher-1/ACloudViewer/core/AICore/src/tasks/sam3d/session.cpp
    // host to_representation (decoder_gs.py) + PLY
    const int64_t n_tok = (int64_t)raw.size() / 448;
    const int64_t n_gs_total = n_tok * GS_NGAUSS;
    std::vector<float> xyz(n_gs_total * 3), fdc(n_gs_total * 3), op(n_gs_total),
            scl(n_gs_total * 3), rot(n_gs_total * 4);
    for (int64_t n = 0; n < n_tok; n++) {
        const float* r = &raw[n * 448];
        const float cb = (float)coords[n * 4 + 1];
        const float cby = (float)coords[n * 4 + 2];
        const float cbz = (float)coords[n * 4 + 3];
        for (int g = 0; g < GS_NGAUSS; g++) {
            float* X = &xyz[(n * GS_NGAUSS + g) * 3];
            X[0] = (cb + 0.5f) / 64.f;
            X[1] = (cby + 0.5f) / 64.f;
            X[2] = (cbz + 0.5f) / 64.f;
            // offset: raw*lr(1.0) + perturbation; tanh / 64 * 0.5 * voxel_size
            for (int c = 0; c < 3; c++) {
                float o = r[g * 3 + c] + perturb[g * 3 + c];
                X[c] += tanhf(o) / 64.f * 0.5f * GS_VOXEL_SIZE;
            }
            float* F = &fdc[(n * GS_NGAUSS + g) * 3];
            for (int c = 0; c < 3; c++) F[c] = r[96 + g * 3 + c];
            float* S = &scl[(n * GS_NGAUSS + g) * 3];
            for (int c = 0; c < 3; c++) S[c] = r[192 + g * 3 + c];
            float* R = &rot[(n * GS_NGAUSS + g) * 4];
            for (int c = 0; c < 4; c++) R[c] = r[288 + g * 4 + c] * 0.1f;
            op[n * GS_NGAUSS + g] = r[416 + g];
        }
    }
    if (!write_gaussian_ply(out_ply, n_gs_total, xyz, fdc, op, scl, rot)) {
        LOGE("e2e: failed to write %s", out_ply.c_str());
        return 1;
    }
    // The PLY is the durable Gaussian interchange artifact. Release the
    // decoder-only host buffers before the optional mesh/PBR branch so the
    // native 100-view bake has the same memory envelope as pbr-assemble.
    raw.clear();
    raw.shrink_to_fit();
    xyz.clear();
    xyz.shrink_to_fit();
    fdc.clear();
    fdc.shrink_to_fit();
    op.clear();
    op.shrink_to_fit();
    scl.clear();
    scl.shrink_to_fit();
    rot.clear();
    rot.shrink_to_fit();

    const bool export_raw_mesh = !out_mesh_vertices.empty();
    if (export_raw_mesh || !out_pbr.empty()) {
        MeshDecoderRunOptions mesh_options;
        mesh_options.model_path =
                models_dir + "/slat_decoder_mesh-" + mesh_dt + ".gguf";
        mesh_options.backend = be_name;
        mesh_options.threads = nthreads;
        MeshDecoderRunResult mesh_decode;
        std::string mesh_error;
        if (opt.progress) opt.progress(kStageMeshDecode, 0, 0);
        if (!run_mesh_decoder(x_slat.data(), coords.data(), tb.nf, mesh_options,
                              mesh_decode, mesh_error)) {
            LOGE("e2e: mesh decoder failed: %s", mesh_error.c_str());
            return 1;
        }
        if (mesh_decode.channels != 101 || mesh_decode.resolution != 256) {
            LOGE("e2e: mesh decoder output is [%lld, %lld] at resolution %d, "
                 "expected [101, N] at 256",
                 static_cast<long long>(mesh_decode.channels),
                 static_cast<long long>(mesh_decode.token_count),
                 mesh_decode.resolution);
            return 1;
        }
        FlexiCubesResult flexicubes;
        if (!decode_flexicubes(mesh_decode.features.data(),
                               mesh_decode.coordinates.data(),
                               mesh_decode.token_count, mesh_decode.resolution,
                               flexicubes, mesh_error)) {
            LOGE("e2e: FlexiCubes extraction failed: %s", mesh_error.c_str());
            return 1;
        }
        if (export_raw_mesh) {
            std::vector<int32_t> mesh_faces;
            mesh_faces.reserve(flexicubes.indices.size());
            for (uint32_t index : flexicubes.indices) {
                if (index > static_cast<uint32_t>(
                                    std::numeric_limits<int32_t>::max())) {
                    LOGE("e2e: FlexiCubes index exceeds SAMT I32 range");
                    return 1;
                }
                mesh_faces.push_back(static_cast<int32_t>(index));
            }
            const int64_t vertex_count =
                    static_cast<int64_t>(flexicubes.positions.size() / 3);
            const int64_t face_count =
                    static_cast<int64_t>(mesh_faces.size() / 3);
            if (!save_raw_tensor_f32(out_mesh_vertices, {3, vertex_count},
                                     flexicubes.positions.data()) ||
                !save_raw_tensor_i32(out_mesh_faces, {3, face_count},
                                     mesh_faces.data())) {
                LOGE("e2e: failed to write raw FlexiCubes mesh interchange "
                     "artifacts");
                return 1;
            }
            LOGI("e2e: wrote raw FlexiCubes mesh (%lld vertices, %lld faces)",
                 static_cast<long long>(vertex_count),
                 static_cast<long long>(face_count));
        }
        if (!out_pbr.empty()) {
#if !defined(SAM3D_USE_NVDIFFRAST_CUDARASTER) || !defined(SAM3D_USE_MESHFIX_GPL)
            LOGE("e2e: --pbr-out requires a CUDA native-PBR build with "
                 "SAM3D_GGML_NVDIFFRAST_NONCOMMERCIAL=ON and "
                 "SAM3D_GGML_MESHFIX_GPL=ON");
            return 1;
#else
            NativeMesh decoded_mesh;
            decoded_mesh.positions = std::move(flexicubes.positions);
            decoded_mesh.indices = std::move(flexicubes.indices);
            decoded_mesh.vertex_attributes =
                    std::move(flexicubes.vertex_attributes);
            GaussianSplatSet splats;
            if (!load_gaussian_splat_ply(out_ply, splats, mesh_error)) {
                LOGE("e2e: failed to reopen native Gaussian PLY for PBR: %s",
                     mesh_error.c_str());
                return 1;
            }
            NativePbrPipelineConfig pbr_config;
            pbr_config.random_seed = seed;
            NativePbrPipelineResult pbr_result;
            if (!assemble_official_pbr_cuda(decoded_mesh, splats, pbr_config,
                                            pbr_result, mesh_error) ||
                !write_pbr_glb(out_pbr, pbr_result.mesh, mesh_error)) {
                LOGE("e2e: native PBR assembly failed: %s", mesh_error.c_str());
                return 1;
            }
            auto texture_path = std::filesystem::path(out_pbr);
            texture_path.replace_extension(".base_color.png");
            if (!write_rgba_png(texture_path.string(),
                                pbr_result.mesh.material.base_color_texture,
                                mesh_error)) {
                LOGE("e2e: failed to write base-color texture: %s",
                     mesh_error.c_str());
                return 1;
            }
            LOGI("e2e: wrote %s (%zu rendered views, %zu final triangles)",
                 out_pbr.c_str(), pbr_result.rendered_views,
                 pbr_result.final_faces);
#endif
        }
    }
    LOGI("e2e: wrote %s (%lld gaussians) in %.1fs for native generation stages",
         out_ply.c_str(), (long long)n_gs_total, elapsed_seconds());
    if (!dtype_contract.complete(dtype_contract_error)) {
        LOGE("e2e: failed to write dtype contract: %s",
             dtype_contract_error.c_str());
        return 1;
    }
    return 0;
}

// Legacy entry point kept for the remaining CLI commands.
RunResult run_pipeline(const CliOptions& opts) {
    RunResult r;
    if (opts.condition_dir.empty()) {
        r.error =
                "condition_dir is required; provide a dump_e2e_stages.py "
                "output directory";
        return r;
    }
    if (opts.out_ply.empty()) {
        r.error = "out_ply is required";
        return r;
    }
    if (opts.models_dir.empty()) {
        r.error = "models_dir is required";
        return r;
    }
    // Keep the C API and CLI on one implementation so parity fixes cannot
    // drift between entry points. All knobs travel through E2eOptions.
    E2eOptions e2e;
    e2e.models_dir = opts.models_dir;
    e2e.cond_dir = opts.condition_dir;
    // image-to-3d generates noise internally (empty noise_dir = fresh noise)
    e2e.out_ply = opts.out_ply;
    e2e.dbg_dir = opts.dump_dir;
    e2e.backend = opts.backend.empty() ? "auto" : opts.backend;
    e2e.threads = opts.n_threads;
    e2e.seed = static_cast<unsigned>(opts.seed);
    e2e.dtype =
            "f32";  // historical image-to-3d default (SAM3D_E2E_DTYPE unset)
    const int rc = cmd_e2e(e2e);
    r.ok = rc == 0;
    if (!r.ok) r.error = "end-to-end graph session failed; see log output";
    return r;
}

namespace {

class ScopedConditionDirectory {
public:
    ~ScopedConditionDirectory() {
        if (!remove_on_exit_) return;
        std::error_code error;
        std::filesystem::remove_all(path_, error);
        if (error) {
            LOGW("image-to-3d: unable to remove temporary conditions %s: %s",
                 path_.c_str(), error.message().c_str());
        }
    }

    bool create(const std::string& requested_path, std::string& error) {
        if (!requested_path.empty()) {
            path_ = requested_path;
            std::error_code filesystem_error;
            std::filesystem::create_directories(path_, filesystem_error);
            if (filesystem_error) {
                error = "cannot create condition directory '" + path_ +
                        "': " + filesystem_error.message();
                return false;
            }
            return true;
        }

        std::error_code filesystem_error;
        const std::filesystem::path root =
                std::filesystem::temp_directory_path(filesystem_error);
        if (filesystem_error) {
            error = "cannot determine the system temporary directory: " +
                    filesystem_error.message();
            return false;
        }
        const auto nonce = static_cast<unsigned long long>(
                std::chrono::steady_clock::now().time_since_epoch().count());
        for (unsigned attempt = 0; attempt < 128; ++attempt) {
            const std::filesystem::path candidate =
                    root / ("sam3d-native-conditions-" + std::to_string(nonce) +
                            "-" + std::to_string(attempt));
            filesystem_error.clear();
            if (std::filesystem::create_directory(candidate,
                                                  filesystem_error)) {
                path_ = candidate.string();
                remove_on_exit_ = true;
                return true;
            }
            if (filesystem_error &&
                filesystem_error != std::errc::file_exists) {
                error = "cannot create temporary condition directory: " +
                        filesystem_error.message();
                return false;
            }
        }
        error = "cannot reserve a unique temporary condition directory";
        return false;
    }

    const std::string& path() const { return path_; }

